{
    "Kris Mpu Gandring": "Kris Mpu Gandring, a cursed kris of Ken Arok. tthe unfinished or incomplete kris would kill seven men, including Ken Arok. (Folklore of Indonesia)",
    "Eye of Horus": "Eye of Horus, Set and Horus were fighting for the throne after Osiris's death, Set gouged out Horus's left eye. The majority of the eye was restored by Thoth. When Horus's eye was recovered, he offered it to his father, Osiris, in hopes of restoring his life. (Egyptian mythology)",
    "Gleipnir": "Gleipnir, the magic chain that bound the wolf Fenrir. It was light and thin as silk but strong as creation itself and made from six impossible ingredients. (Norse mythology)",
    "Four Treasures of the Tuatha Dé Danann": "Four Treasures of the Tuatha Dé Danann (also Hallows of Ireland), consisting of the Claíomh Solais, Brionac, Cauldron of the Dagda, and the Lia Fáil. (Celtic mythology)",
    "Shamrock": "Shamrock, ancient Druids honored it as a sacred plant. The Druids believed the shamrock had the power to avert evil spirits. Some people still believe the shamrock has mystical, even prophetic powers. It is said that the leaves of shamrocks turn upright whenever a storm is coming. (Irish mythology)",
    "Xiuhcoatl": "Xiuhcoatl, a lightning-like weapon borne by Huitzilopochtli. (Aztec religion)",
    "Falcon Cloak": "Falcon Cloak, owned by Freyja, it allows the wielder to turn into a falcon and fly. (Norse mythology)",
    "Sun Wukong's magical headband": "Sun Wukong's magical headband, Guanyin gives Xuanzang a gift from the Buddha. A magical headband which, once Sun Wukong is tricked into putting it on, can never be removed. With a special chant, the band will tighten and cause unbearable pain. (Chinese mythology)",
    "Galatea": "Galatea, a statue carved of ivory by Pygmalion of Cyprus, which the goddess Aphrodite brought it to life and united the couple in marriage. (Greek mythology)",
    "Flying Canoe": "Flying Canoe (also Bewitched Canoe or Flying Canoe), Baptiste had a canoe with paddles, he made a pact with the devil so his canoe would fly wherever Baptiste wished. However, those within the canoe could not say the name of God, fly over a church, touch any crosses, or the canoe would crash. Baptiste uttered the magic words: \"Acabris! Acabras! Acabram\" to make the canoe fly. (Canadian folklore)",
    "Soma": "Soma, it is described as being prepared by extracting juice from the stalks of a certain plant. In both Vedic and Zoroastrian tradition, the name of the drink and the plant are the same, and also personified as a divinity, the three forming a religious or mythological unity. (Hindu mythology)",
    "Graeae's eye": "Graeae's eye, three sisters who shared one eye among themselves. (Greek mythology)",
    "Hungry grass": "Hungry grass (also Féar Gortach), a patch of cursed grass. Anyone walking on it was doomed to perpetual and insatiable hunger. (Irish mythology)",
    "Ikenga": "Ikenga, a status that bestows the owner with super strength. (Igbo mythology)",
    "Kaustubha": "Kaustubha is a divine jewel or \"Mani\", which is in the possession of Lord Vishnu. (Hindu mythology)",
    "Lyngurium": "Lyngurium (also Ligurium), the name of a mythical gemstone believed to be formed of the solidified urine of the lynx (the best ones coming from wild males). (Medieval legend)",
    "Phylactery": "Phylactery, an amulet or charm, worn for its supposed magical or supernatural power.",
    "St. Louis Ghost Train": "St. Louis Ghost Train, visible at night along an old abandoned rail line in between Prince Albert and St. Louis, Saskatchewan. (Canadian legend)",
    "Aegis": "Aegis, Zeus' shield, often loaned to his daughter Athena, also used by Perseus. (Greek mythology)",
    "Shield of Ajax": "Shield of Ajax, a huge shield made of seven cow-hides with a layer of bronze. (Greek mythology)",
    "Ara": "Ara (Altar), identified as the altar where the gods first made offerings and formed an alliance before defeating the Titans. (Greek mythology)",
    "Tide jewels": "Tide jewels, the kanju (干珠?, lit. \"(tide-)ebbing jewel\") and manju (満珠?, lit. \"(tide-)flowing jewel\") were magical gems that the Sea God used to control the tides. (Japanese mythology)",
    "Excalibur's scabbard": "Excalibur's scabbard, was said to have powers of its own. Injuries from losses of blood, for example, would not kill the bearer. In some telling, wounds received by one wearing the scabbard did not bleed at all. (Arthurian legend)",
    "Väinämöinen's harp": "Väinämöinen's harp, he killed a pike and fashioned a harp out of the bones of the fish. However, he dropped his instrument into the sea, and thus it fell into the power of the sea gods, hence the origin of the music of the ocean on the beach. So, he made another one out of the forest wood, and with it, he descended into Pohjola looking for the Sampo. Väinämöinen struck his harp and sent the inhabitants to sleep and ran off with the Sampo. Upon reaching the land of light, the inhabitants of Pohjola woke up again, and went after him to retrieve the Sampo which, in the struggle, fell into the sea and was inevitably lost. (Finnish mythology)",
    "Megingjörð": "Megingjörð (Power-belt), a magic belt worn by the god Thor. (Norse mythology)",
    "Nidhi": "Nidhi (also called Nidhana, Nikhara, and Sevadhi), in Hindu mythology, that is, a treasure, constitutes of nine treasures (nawanidhi) belonging to Kubera, god of wealth. (Hindu mythology)",
    "Brahmanda Astra": "Brahmanda Astra, it is said in the epic Mahabharata that the weapon manifests with the all five heads of Lord Brahma as its tip. Brahma earlier lost his fifth head when he fought with Lord Shiva. This weapon is said to possess the power to destroy entire solar system or Brahmand, the 14 realms according to Hindu cosmology. (Hindu mythology)",
    "Svefnthorn": "Svefnthorn (Sleep Thorn), it was used to put an adversary into a deep sleep from which he or she would not awaken for a long time. (Norse mythology)",
    "Indravarman III's metalwood bat": "Indravarman III's metalwood bat, a legendary bat wielded by a Cambodian emperor.[7] (Buddhist mythology)",
    "Helmet of Rostam": "Helmet of Rostam, upon which was fixed the head of the white giant Div-e-Sepid, from the Persian epic Shahnameh. (Persian mythology)",
    "Velificatio": "Velificatio, a stylistic device used in ancient Roman art to frame a deity by means of a billowing garment. It represents \"vigorous movement,\" an \"epiphany\", or \"the vault of heaven,\" often appearing with celestial, weather, or sea deities. (Roman mythology)",
    "Nemean lion's hide": "Nemean lion's hide, the lion could not be killed with mortals' weapons because its golden fur was impervious to attacks. (Greek mythology)",
    "Mímir's head": "Mímir's head, the Vanir beheaded Mímir and returned his head to Asgard. In order to keep Mímir's wisdom, Odin preserved his head with magic so it could continue to provide knowledge and counsel as his advisor. (Norse mythology)",
    "Kibisis": "Kibisis, the ancient Greek word kibisis, said to describe the sack carried by the god Hermes and the sack in which the mythical hero Perseus carried the severed head of the monster Medusa. It has been typically translated as \"wallet\". (Greek mythology)",
    "Canoe of Māui": "Canoe of Māui, it became the South Island of New Zealand. (Māori mythology)",
    "Round Table": "Round Table, King Arthur's famed table, around which he and his Knights congregate. As its name suggests, it has no head, implying that everyone who sits there has equal status. (Arthurian legend)",
    "Silver bullet": "Silver bullet, a bullet cast from silver is often the only weapon that is effective against a werewolf, witch, or other monsters.",
    "Fountain of Youth": "Fountain of Youth, is a spring that supposedly restores the youth of anyone who drinks or bathes in its waters. (Medieval legend)",
    "Chinvat Bridge": "Chinvat Bridge (also Bridge of the Requiter), a sifting bridge which separates the world of the living from the world of the dead. All souls must cross the bridge upon death. The bridge is guarded by two four-eyed dogs. (Zoroastrianism)",
    "Sessho-seki": "Sessho-seki (also Killing Stone), a stone that kills anyone who comes into contact with it. (Japanese mythology)",
    "World Mill": "World Mill (also Heavenly Mill and Cosmic Mill), a mytheme suggested as recurring in Indo-European and other mythologies. It involves the analogy of the cosmos or firmament and a rotating millstone.",
    "Shield of Evalach": "Shield of Evalach, a white shield belonging to king Evalach. Josephus of Arimathea painted a red cross upon it with his own blood, which granted the owner heavenly protection. It was later won by Sir Galahad. (Arthurian legend)",
    "Eldhrímnir": "Eldhrímnir, the cauldron in which Andhrímnir cooks Sæhrímnir. (Norse mythology)",
    "Stone and Ring of Eluned the Fortunate": "Stone and Ring of Eluned the Fortunate, one might describe it as a cloak of invisibility. It's said that Merlin once possessed this item for a while. (Welsh mythology)",
    "Shankha": "Shankha, a conch shell which is of ritual and religious importance in both Hinduism and Buddhism. The Shankha is a sacred emblem of the Hindu preserver god Vishnu. It is still used as a trumpet in Hindu ritual, and in the past was used as a war trumpet. (Hindu mythology)",
    "Ogmios's whip": "Ogmios's whip, the sun-god is depicted holding a whip. (Celtic mythology)",
    "Chentu": "Chentu, a horse whip which looks like a crooked stick, and is a typical attribute of Aiyanar, Krishna in his aspect as Rajagopala, and Shiva with Nandi. (Hindu mythology)",
    "Ring of Mudarra": "Ring of Mudarra, the ring that Gonzalo Gustioz breaks in two pieces to so he can later on recognize the son with which his lover is pregnant. When that son, Mudarra, joins the two halves, it again becomes a complete ring and Gonzalo Gustioz is healed of his blindness in the epic poem Cantar de los Siete Infantes de Lara.[11] (Spanish mythology)",
    "Armour of Achilles": "Armour of Achilles, created by Hephaestus and said to be impenetrable. (Greek mythology)",
    "Stambha": "Stambha (also Skambha), believed to be a cosmic column. It is believed that the stambha functions as a bond, which joins the heaven (Svarga) and the earth (prithvi). (Hindu mythology)",
    "Moly": "Moly, a magical herb Hermes gave to Odysseus to protect him from Circe's magic when he went to her home to rescue his friends. (Greek mythology)",
    "Fafnir's blood": "Fafnir's blood, Sigurd bathed in dragon's blood that conferred him invulnerability. He also drank some of Fafnir's blood and gained the ability to understand the language of the birds. (Norse mythology)",
    "Golden egg": "Golden egg, the main object of the folk tale \"Kurochka Ryaba\". (Russian folklore)",
    "Brahmashirsha Astra": "Brahmashirsha Astra, It is thought that the Brahmashirsha Astra is the evolution of the Brahmastra, and 4 times stronger than Brahmastra. The weapon manifests with the four heads of Lord Brahma as its tip. When it strikes an area it will cause complete destruction and nothing will grow, not even a blade of grass, for the next 12 years. It will not rain for 12 years in that area, and everything including metal and earth become poisoned. (Hindu mythology)",
    "Tathlum": "Tathlum, the missile fired by Lugh from the Sling-stone. (Irish mythology)",
    "Dragon scales": "Dragon scales, the skin of a dragon was said to be made of impenetrable scales. (Medieval legend)",
    "Gjallarbrú": "Gjallarbrú (Gjöll Bridge), a covered bridge \"thatched with glittering gold\" which spans the river Gjöll in the underworld. It must be crossed in order to reach Hel. (Norse mythology)",
    "Ring of Gyges": "Ring of Gyges, a mythical magical artifact that granted its owner the power to become invisible at will. (Greek mythology)",
    "Ayudhapurusha": "Ayudhapurusha, the anthropomorphic depiction of a divine weapon in Hindu art. Ayudhapurushas are sometimes considered as partial incarnates of their divine owners. (Hindu mythology)",
    "Scale of Maat": "Scale of Maat, Anubis weighed the persons heart on a scale against the feather of Maat. If the heart is lighter than the feather, the person is allowed to pass into the afterlife. If not, the heart is eaten by the waiting Ammit. (Egyptian mythology)",
    "Excalibur": "Excalibur, it is also sometimes referred to as: Caliburn, Caledfwlch, Calesvol, Kaledvoulc'h, Caliburnus due to inconsistencies within the various Arthurian legends. Sometimes attributed with magical powers or associated with the rightful sovereignty of Great Britain. Stated that it was forged on the Isle of Avalon.",
    "Seven trumpets": "Seven trumpets, seven angels with seven trumpets are sounded and the events that follow are described in detail from Revelation Chapters 8 to 11. (Christian mythology)",
    "Leviathan's hide": "Leviathan's hide, could be turned into everlasting clothing or impenetrable suits of armor. (Jewish mythology)",
    "Ullr's bone": "Ullr's bone, Ullr could traverses the sea on his magic bone. (Norse mythology)",
    "Pearly gates": "Pearly gates, a conceptual entry to Heaven. (Christian mythology)",
    "Gandiva": "Gandiva, created by Brahma and given by Varuna to Arjuna on Agni's request and used by Arjuna during the Kurukshetra war. (Hindu mythology)",
    "Talaria": "Talaria, Hermes's winged sandals which allowed him to fly. (Greek mythology)",
    "Shield of El Cid": "Shield of El Cid, according to the epic poem Carmen Campidoctoris, bears the image of a fierce shining golden dragon.[1]",
    "Medusa's head": "Medusa's head, Medusa was beheaded by the hero Perseus, who thereafter used her head, which retained its ability to turn onlookers to stone, as a weapon until he gave it to the goddess Athena to place on her Aegis. (Greek mythology)",
    "Fern flower": "Fern flower, a magic flower that blooms for a very short time on the eve of the Summer solstice. The flower brings fortune to the person who finds it. (Slavic mythology)",
    "Shield of Joseph of Arimathea": "Shield of Joseph of Arimathea, according to Arthurian legend it was carried by three maidens to Arthur's castle where it was discovered by Sir Percival. In Perlesvaus he uses it to defeat the Knight of the Burning Dragon. (Arthurian legend)",
    "Necklace of the Lady of the Lake": "Necklace of the Lady of the Lake, a jeweled necklace given to Sir Pelleas after assisting an old woman across a river. It was enchanted so that its wearer would be unfathomably loved. Its true name is unknown. (Arthurian legend)",
    "Halo": "Halo (also nimbus, aureole, glory, or gloriole), is a ring of light that surrounds a person in art. They have been used in the iconography of many religions to indicate holy or sacred figures, and have at various periods also been used in images of rulers or heroes.",
    "Brahmastra": "Brahmastra, described in a number of the Puranas, it was considered the deadliest weapon. It was said that when the Brahmastra was discharged, there was neither a counterattack nor a defense that could stop it. (Hindu mythology)",
    "Bident": "Bident, a two-pronged implement resembling a pitchfork. In classical mythology, the bident is associated with Pluto/Hades, the ruler of the underworld. (Greek mythology)",
    "Gjallarhorn": "Gjallarhorn, a mystical horn blown at the onset of Ragnarök associated with the god Heimdallr and the wise being Mímir. (Norse mythology)",
    "Peacock's feather": "Peacock's feather, the peacock was the patron bird of the Goddess Hera. According to myth, she adorned the tail of a peacock with Argus's eyes on its feathers in his honor, symbolizing all-seeing knowledge and the wisdom of the heavens. (Greek mythology)",
    "Green Armour": "Green Armour, protects the wearer from physical injuries. (Arthurian legend)",
    "Amrita": "Amrita, the drink of the gods which grants them immortality. (Hindu mythology)",
    "Ruyi": "Ruyi (As Desired or As [You] Wish), is a curved decorative object that serves as a ceremonial sceptre in Chinese Buddhism or a talisman symbolizing power and good fortune in Chinese folklore. (Chinese folklore)",
    "Sagitta": "Sagitta, regarded as the weapon that Hercules used to kill the eagle Aquila that perpetually gnawed Prometheus' liver. (Greek mythology)",
    "Peaches of Immortality": "Peaches of Immortality, consumed by the immortals due to their mystic virtue of conferring longevity on all who eat them. (Chinese mythology)",
    "Neith's loom": "Neith's loom, Neith as a goddess of weaving she wove all of the world and existence into being on her loom. (Egyptian mythology)",
    "Astra": "Astra, a supernatural weapon, presided over by a specific deity. To summon or use an astra required knowledge of a specific incantation/invocation, when armed. (Hindu mythology)",
    "Five-colored Jewel from a Dragon's Neck": "Five-colored Jewel from a Dragon's Neck, a jewel that shines five colors found in a dragon's neck. One of Kaguya-hime's suitor set out to search for the jewel. (Japanese mythology)",
    "Apple of Discord": "Apple of Discord (also Golden Apple of Discord), the goddess Eris inscribed \"to the fairest\" and tossed in the midst of the festivities at the wedding of Peleus and Thetis. (Greek mythology)",
    "Djed": "Djed, Isis asked for the pillar in the palace hall from the king and queen of Byblos in Lebanon, and upon being granted it, extracted the coffin from the pillar. She then consecrated the pillar, anointing it with myrrh and wrapping it in linen. This pillar came to be known as the pillar of djed. (Egyptian mythology)",
    "Sistrum": "Sistrum, one of the most sacred musical instruments in ancient Egypt and was believed to hold powerful magical properties. It was also shaken to avert the flooding of the Nile and to frighten away Set. (Egyptian mythology)",
    "Agimat": "Agimat, a Filipino word for \"amulet\" or \"charm\".",
    "Swan Cloak": "Swan Cloak, a magic robe made of swan feathers belonging to a swan maiden.",
    "David's harp": "David's harp (also Kinnor David), a harp hung above King David's bed, and precisely at midnight a north wind arrived and blew on the harp and it would play by itself. (Jewish mythology)",
    "World egg": "World egg (also Cosmic Egg or Mundane Egg), found in the creation myths of many cultures and civilizations. The world egg is a beginning of some sort, and the universe or some primordial being comes into existence by \"hatching\" from the egg, sometimes lain on the primordial waters of the Earth.",
    "Cauldron of the Dagda": "Cauldron of the Dagda, a cauldron where no company ever went away from it unsatisfied, it is said to be bottomless. (Celtic mythology)",
    "Tarnkappe": "Tarnkappe, Sigurd's magical cloak that made the wearer invisible. (Norse mythology)",
    "Ancile": "Ancile, the shield of the Roman god Mars. One divine shield fell from heaven during the reign of Numa Pompilius, the second king of Rome. He ordered eleven copies made to confuse would-be thieves. (Roman mythology)",
    "Cup of Jamshid": "Cup of Jamshid, a cup of divination that was long possessed by rulers of ancient Persia and was said to be filled with an elixir of immortality. The whole world was said to be reflected in it. (Persian mythology)",
    "Gjöll": "Gjöll, the name of the rock which Fenrir the wolf is bound. (Norse mythology)",
    "Varunastra": "Varunastra, a water weapon (a storm) according to the Indian scriptures, incepted by Varuna. In stories it is said to assume any weapon's shape, just like water. This weapon is commonly mentioned as being used to counter the Agneyastra. (Hindu mythology)",
    "Dragon's teeth": "Dragon's teeth, in the legends of the Phoenician prince Cadmus and in Jason's quest for the Golden Fleece. In each case, the dragons are real and breathe fire. Their teeth, once planted, would grow into fully armed warriors. (Greek mythology)",
    "Philosopher's stone": "Philosopher's stone, said to perform alchemy without an equal sacrifice being made, such as turning lead to gold, and creating something out of nothing. (Medieval legend)",
    "Shirt of Nessus": "Shirt of Nessus, the poisoned shirt that killed Heracles. (Greek mythology)",
    "Canoe of Gluskab": "Canoe of Gluskab, able to expand so it could hold an army, or shrink to fit in the palm of your hand. (Abenaki mythology)",
    "Goswhit": "Goswhit, the helmet of King Arthur, passed down to him from Uther Pendragon. (Arthurian legend)",
    "Hansa Yukta Vimana": "Hansa Yukta Vimana, a flying machine of Lord Brahma, looks like it is driven by swans and is completely white in color. (Hindu mythology)",
    "Gates of hell": "Gates of hell, are various places on the surface of the world that have acquired a legendary reputation for being entrances to the underworld. Often they are found in regions of unusual geological activity, particularly volcanic areas, or sometimes at lakes, caves or mountains.",
    "Dagger of Rostam": "Dagger of Rostam, a glittering dagger that Rostam used to beheaded the white daeva Div-e Sepid. (Persian mythology)",
    "Ame-no-Ohabari": "Ame-no-Ohabari (also Ama-no-Ohabari), used by Izanagi to kill his offspring, Kagu-tsuchi.",
    "Pied Piper's magic pipe": "Pied Piper's magic pipe, Pied Piper was able to lure the rats away with his pipe, which he later turned his power that he put into his pipe on the town of Hamelin's children, leading them away as he had the rats. (German folklore)",
    "Confederate gold": "Confederate gold, an hidden caches of gold lost after the American Civil War. Millions of dollars' worth of gold was lost or unaccounted for after the war and has been the speculation of many historians and treasure hunters. Allegedly, some of the Confederate treasury was hidden in order to wait for the rising again of the South and at other times simply so that the Union would not gain possession. (American legend)",
    "Týr's hand": "Týr's hand, after Fenrir had been bound by the gods, he struggled to try to break the rope. He could not break the ribbon and, enraged, bit Týr's right hand off. (Norse mythology)",
    "Santa's sleigh": "Santa's sleigh, Santa Claus on a reindeer sleigh pulled by flying reindeer and help him deliver presents to children.",
    "Brazen head": "Brazen head (also brass head or bronze head), a legendary automaton that often appeared in literature, reputed to be able to answer any question. It was said to have been owned by medieval scholars who were believed to be wizards, or who were reputed to be able to answer any question. The device was always in the form of a man's head, and it could correctly answer any question asked of it. (Medieval legend)",
    "Imhullu": "Imhullu, a weapon used by the Assyrian god Marduk to destroy Tiamat, described in the ancient epic of creation Enûma Eliš. (Mesopotamian mythology)",
    "Father Time's hourglass": "Father Time's hourglass, carrying an hourglass representing time's constant movement. Many belief that Father Time, like the Grim Reaper, is constantly watching humans and has each and every one of their hourglasses slowly decreasing, sand casually slipping through the hands of time.",
    "Sledovik": "Sledovik, a most widespread type of sacred stones, venerated in Slavic (Russian, Belarusian, Ukrainian) and Uralic (Karela, Merya) pagan practices. (Slavic mythology)",
    "Whetstone of Tudwal Tudglyd": "Whetstone of Tudwal Tudglyd, sharpens the blade of a fine warrior. It shall draw blood from any enemy of its user if its user be brave; if its user shall be cowardly, than the blade shall not be sharpened and draw no blood whatsoever. (Welsh mythology)",
    "Járngreipr": "Járngreipr (Iron Grippers), a pair of iron gauntlets of the god Thor. (Norse mythology)",
    "Areadbhar": "Areadbhar (also Areadbhair), belonged to Pisear, king of Persia. Its tip had to be kept immersed in a pot of water to keep it from igniting, a property similar to the Lúin of Celtchar. (Irish mythology)",
    "Pais Badarn Beisrydd, The Coat of Padarn Red-Coat": "Pais Badarn Beisrydd, The Coat of Padarn Red-Coat: if a well-born man put it on, it would be the right size for him; if a churl, it would not go upon him. One of the Thirteen Treasures of the Island of Britain. (Welsh mythology)",
    "Magic Bullet": "Magic Bullet, an enchanted bullet obtained through a contract with the devil in the German folk legend Freischütz. A marksman has obtained a certain number of bullets destined to hit without fail whatever object he wishes. Six of the magic bullets (German: Freikugeln, literally \"free bullets\"), are thus subservient to the marksman's will, but the seventh is at the absolute disposal of the devil himself. (German folklore)",
    "Rama Setu": "Rama Setu (also Rama's Bridge), two apes named Nala and Nila construct a floating bridge across the sea, using stones that floated on water because they had Rama's name written on them in the epic poem Ramayana. ((Hindu mythology)",
    "Kris Setan Kober": "Kris Setan Kober, belong to Arya Penangsang, the mighty viceroy (adipati) of Jipang who was killed by his own kris called Setan Kober (\"devil of the grave\"). Forged by Empu Bayu Aji in the kingdom of Pajajaran, and had 13 luk on its blade. (Folklore of Indonesia)",
    "Smoking Mirror": "Smoking Mirror, the mirror that the god Tezcatlipoca uses to see the whole cosmos. (Aztec mythology)",
    "Loeðing": "Loeðing, the Æsir made a very strong fetter and they took it to Fenrir and to test his strength against it. But the fetter broke. (Norse mythology)",
    "Ǒusībùyúnlǚ": "Ǒusībùyúnlǚ (Cloud-stepping Boots or Cloud-stepping Shoes), made of lotus fiber, these are one of the treasures of the Dragon Kings; Ào Ming gives them to Sun Wukong in order to get rid of him when he acquires the Ruyi Jingu Bang. (Chinese mythology)",
    "Mantle of Arthur": "Mantle of Arthur (also Llen Arthyr yng Nghernyw), whoever was under it could not be seen, and he could see everyone. One of the Thirteen Treasures of the Island of Britain. This item is known from two other sources, the prose tales Culhwch and Olwen (c. 1100) and The Dream of Rhonabwy (early 13th century). A very similar mantle also appears in the Second Branch of the Mabinogi, in which it is used by Caswallawn to assassinate the seven stewards left behind by Bran the Blessed and usurp the throne. (Welsh mythology)",
    "Rán's net": "Rán's net, a net in which she tried to capture men who ventured out on the sea. Her net is also mentioned in Reginsmál and in the Völsunga saga, where she lends it to Loki so that he can capture Andvari. (Norse mythology)",
    "Noah's Ark": "Noah's Ark, the vessel by which God spares Noah, his family, and a remnant of all the world's animals from the flood. According to Genesis, God gave Noah instructions for building the ark. (Christian mythology)",
    "Feather of Ma'at": "Feather of Ma'at (also Feather of Truth), her ostrich feather was the measure that determined whether the souls (considered to reside in the heart) of the departed would reach the fields of Aaru successfully. The hearts of the dead were said to be weighed against her single feather in the Hall of Two Truths. (Egyptian mythology)",
    "Thunderbolt": "Thunderbolt, lightning plays a role in many mythologies, often as the weapon of a sky god and weather god. Thunderbolts as divine weapons can be found in many mythologies. In Greek mythology, the thunderbolt is a weapon given to Zeus by the Cyclops, or by Hephaestus in Greek mythology. Zibelthiurdos of Paleo-Balkan mythology is a god recognized as similar to the Greek Zeus as a wielder of lightning and thunderbolts. In Igbo mythology, the thunderbolt is the weapon of Amadioha and in Yoruba mythology, the thunderbolt is the weapon of Shango.",
    "Bezoar": "Bezoar, sought because they were believed to have the power of a universal antidote against any poison. It was believed that a drinking glass which contained a bezoar would neutralize any poison poured into it.",
    "Singasteinn": "Singasteinn (Old Norse singing stone or chanting stone), an object that appears in the account of Loki and Heimdallr's fight in the form of seals. (Norse mythology)",
    "Sudarshana Chakra": "Sudarshana Chakra, a legendary spinning disc like weapon used by the Hindu God Vishnu. (Hindu mythology)",
    "Karun Treasure": "Karun Treasure, said to belong to King Croesus of Lydia. (Persian mythology)",
    "Vajra": "Vajra, the weapon of the Vedic rain and thunder-deity Indra, and is used symbolically by the dharmic traditions to represent firmness of spirit and spiritual power. (Hindu mythology) (Buddhist mythology) (Jain mythology)",
    "Myrrh egg": "Myrrh egg, the phoenix would build itself a nest of cinnamon twigs that it then ignited; both nest and bird burned fiercely and would be reduced to ashes, from which a new, young phoenix arose. The new phoenix embalmed the ashes of the old phoenix in an egg made of myrrh and deposited it in the Egyptian city of Heliopolis (\"the city of the sun\" in Greek). (Greek mythology)",
    "Skofnung": "Skofnung, the legendary Danish king Hrólf Kraki. It was renowned for supernatural sharpness and hardness, as well as for being imbued with the spirits of the king's twelve faithful berserker bodyguards.",
    "Icarus' wings": "Icarus' wings, Daedalus tied feathers together from smallest to largest so as to form an increasing surface. Secured the feathers at their midpoints with string and at their bases with wax, and gave the whole a gentle curvature like the wings of a bird. (Greek mythology)",
    "Three Sacred Treasures": "Three Sacred Treasures of Japan, consisting of the Kusanagi, the jewel necklace Yasakani no Magatama, and the mirror Yata no Kagami. (Japanese mythology)",
    "Vimana": "Vimana, a mythological flying machine from the Sanskrit epics. (Hindu mythology)",
    "Drómi": "Drómi, the Æsir made another fetter twice as strong and Fenrir tested himself against the fetter, the fetter broke into pieces. (Norse mythology)",
    "Indra's net": "Indra's net, the net was one of the weapons of the sky-god Indra, used to snare and entangle enemies. The net also signifies magic or illusion. (Hindu mythology)",
    "Horn of Gabriel": "Horn of Gabriel, the name refers to the tradition identifying the Archangel Gabriel with the angel who blows the horn to announce Judgement Day, associating the infinite with the divine. (Christian mythology)",
    "Tarnhelm": "Tarnhelm, a magic helmet giving the wearer the ability to change form or become invisible. Used by Alberich in Der Ring des Nibelungen. (Continental Germanic mythology)",
    "Stone of Giramphiel": "Stone of Giramphiel, a stone described in Diu Crône. Sir Gawain wins from the knight Fimbeus and it offers him protection against the fiery breath of dragons and the magic of the sorcerer Laamorz. (Arthurian legend)",
    "Seven-league boots": "Seven-league boots from European folklore were said to allow the wearer to make strides of seven leagues in length. (European folklore)",
    "Babr-e Bayan": "Babr-e Bayan, the mythical coat worn by the Persian legendary hero Rostam in combat. (Persian mythology)",
    "Chessboard of Gwenddoleu ap Ceidio": "Chessboard of Gwenddoleu ap Ceidio, a large chess board with pieces of silver and crystal and the board was made of gold. The pieces only play by themselves if all the pieces are set up correctly. (Welsh mythology)",
    "Pandora's box": "Pandora's box, the \"box\" was actually a large jar given to Pandora, which contained all the evils of the world. Pandora opened the jar and all the evils flew out, leaving only Hope inside once she had closed it again. (Greek mythology)",
    "Camahueto's horn": "Camahueto's horn, the most valuable part of a Camahueto is their single horn, machis will use the horn for curing many kinds of illnesses. (Chilote mythology)",
    "Orpheus' lyre": "Orpheus' lyre, a golden lyre given to him by Apollo. When Orpheus heard the Siren's voices, he drew his lyre and played music that was louder and more beautiful, drowning out the Sirens' bewitching songs. (Greek mythology)",
    "Bangu": "Bangu, a beautiful small bell in Glasgwm Church which was gifted by Saint David. Once a woman took the bell to the nearby town of Rharadr. Her husband was imprisoned in the castle and she believed that if she rang the bell he would be released. But the guards seized it and chase her out of town. That night the town was destroyed by fire, and the only part of it which escaped the flames was the wall on which the sacred bell was hanging. (Medieval legend)",
    "Nibelungen ring": "Nibelungen ring, Alberich steals the Rhinegold from the Rhinemaidens, having learned that he who is willing to renounce love will thereby gain the ability to forge a ring of power from the gold. Alberich forges the ring and makes himself lord over all the Nibelungen. (German mythology)",
    "Kavacha": "Kavacha, the armor of Karna that was granted by his father Surya at birth. It was impenetrable even to heavenly weapons. (Hindu mythology)",
    "Shield of Judas Maccabee": "Shield of Judas Maccabee, a red shield emblazoned with a golden eagle. According to Arthurian legend the same shield was later found and used by Gawain after he defeated an evil knight. (Arthurian legend)",
    "Fafnir's heart": "Fafnir's heart, Sigurd roasts Fafnir's heart, and consumes part of it. This gives him the gift of \"wisdom\" (prophecy). (Norse mythology)",
    "Purple Gold Red Gourd": "Purple Gold Red Gourd, a powerful magic gourd that sucks anyone who speaks before it inside and melts them down into a bloody stew. (Chinese mythology)",
    "Gunnar's Atgeir": "Gunnar's Atgeir, Gunnar's atgeir would make a ringing sound or \"sing\" when it was taken down in anticipation of bloodshed. (Norse mythology)",
    "Scale of justice": "Scale of justice, Themis was portrayed carrying scales. (Greek mythology)",
    "Kris Taming Sari": "Kris Taming Sari (Flower Shield or Beautiful Shield), one of the most well-known kris in Malay literature, said to be so skilfully crafted that anyone wielding it was unbeatable. (Malay folklore)",
    "Ukonvasara": "Ukonvasara (also Ukonkirves), the symbol and magical weapon of the Finnish thunder god Ukko, and was similar to Thor's Mjölnir. (Finnish mythology)",
    "Uaithne": "Uaithne (also Dur da Blá, The Oak of Two Blossoms, and Coir Cethar Chuin), the harp which belongs to The Dagda. After the Second Battle of Mag Tuired the Fomorians had taken The Dagda's harp with them. The Dagda found it in a feasting-house wherein Bres and his father Elathan were also. The Dagda had bound the music so that it would not sound until he would call to it. After he called to it, it sprang from the wall, came to the Dagda and killed nine men on its way. (Irish mythology)",
    "Baetylus": "Baetylus, a sacred stone which was supposedly endowed with life. (Greek mythology)",
    "Charmstone": "Charmstone (charm-stone and charm stone), a stone or mineral artifact associated with various traditional culture, including those of Scotland and the native cultures of California and the American southwest.",
    "Siege Perilous": "Siege Perilous (The Perilous Seat), is a vacant seat at the Round Table reserved by Merlin for the knight who would one day be successful in the quest for the Holy Grail. (Arthurian legend)",
    "Busby's stoop chair": "Busby's stoop chair (also Dead Man's Chair), an allegedly haunted oak chair that was cursed by the murderer Thomas Busby before his execution by hanging in North Yorkshire, United Kingdom. (English folklore)",
    "Nandni Vardhanam": "Nandni Vardhanam, the conch shell of Satyaki. (Hindu mythology)",
    "Nábrók": "Nábrók (Death Underpants), are a pair of pants made from the skin of a dead man, which are capable of producing an endless supply of money. (Icelandic folklore)",
    "Magic carpet": "Magic carpet (also flying carpet), a legendary carpet that can be used to transport humans who are on it instantaneously or quickly to their destination. (Arabian mythology)",
    "Senji Ryakketsu": "Senji Ryakketsu (The Summary to Judgements of Divinations), the texts written by the legendary Abe no Seimei during the Heian Period in Japan. The text contains six thousand forecast and thirty-six fortune-telling techniques based on divination through use of shikigami. (Japanese mythology)",
    "Cintamani": "Cintamani (also Chintamani Stone), a wish-fulfilling jewel within both Hindu and Buddhist traditions, equivalent to the philosopher's stone in Western alchemy. (Hindu mythology)",
    "Syamantaka": "Syamantaka (also Syamantakamani and Shyamantaka Jewel), the most famous jewel that is supposed to be blessed with magical powers. (Hindu mythology)",
    "Thread of Ariadne": "Thread of Ariadne, the magical ball of thread given to Theseus by Ariadne to help him navigate the Labyrinth. (Greek Mythology)",
    "Cauldron of Dyrnwch the Giant": "Cauldron of Dyrnwch the Giant, said to discriminate between cowards and brave men: whereas it would not boil meat for a coward, it would boil quickly if that meat belonged to a brave man. (Welsh mythology)",
    "Pair Dadeni": "Pair Dadeni (Cauldron of Rebirth), a magical cauldron able to revive the dead. (Welsh mythology)",
    "Ausadhirdipyamanas": "Ausadhirdipyamanas, healing plants. Used for healing and rejuvenations in battles. These are used by Ashvins. (Hindu mythology)",
    "Fast-walker Boots": "Fast-walker Boots (сапоги-скороходы), allows the person wearing them to walk and run at an amazing pace. (Russian folklore)",
    "Veil of Isis": "Veil of Isis, a metaphor and allegorical artistic motif in which nature is personified as the goddess Isis covered by a veil, representing the inaccessibility of nature's secrets. (Western esotericism)",
    "Aruval": "Aruval, the Tamils revere the weapon, a type of billhook, as a symbol of Karupannar. (Tamil mythology)",
    "Hlidskjalf": "Hlidskjalf, Odin's all-seeing throne in his palace Valaskjálf. (Norse mythology)",
    "Dandu Monara": "Dandu Monara, king Ravana's flying machine in Ramayana. (Hindu mythology)",
    "Palladium": "Palladium, a wooden statue that fell from the sky. As long as it stayed in Troy, the city-state could not lose a war. (Greek mythology)",
    "Thirteen Treasures of the Island of Britain": "Thirteen Treasures of the Island of Britain. (Matter of Britain)",
    "Golden apple": "Golden apple, an element that appears in various national and ethnic folk legends or fairy tales.",
    "Golem": "Golem, an animated anthropomorphic being that is magically created entirely from inanimate matter (specifically clay or mud). The word was used to mean an amorphous, unformed material in Psalms and medieval writing. There are many tales differing on how the golem was brought to life and afterwards controlled. (Jewish folklore)",
    "Drake's Drum": "Drake's Drum, a snare drum that Sir Francis Drake took with him when he circumnavigated the world. Shortly before he died he ordered the drum to be taken to Buckland Abbey and vowed that if England was ever in danger and someone was to beat the drum he would return to defend the country. According to legend it can be heard to beat at times when England is at war or significant national events take place. (English folklore)",
    "Unicorn horn": "Unicorn horn (also Alicorn), the detached horn of an unicorn was though to have many healing properties and antidote's virtues were attributed to the unicorn's horn. (European folklore)",
    "Rota Fortunae": "Rota Fortunae (Wheel of Fortune), a concept in medieval and ancient philosophy referring to the capricious nature of Fate. The wheel belongs to the goddess Fortuna, who spins it at random, changing the positions of those on the wheel - some suffer great misfortune, others gain windfalls. (Greek mythology)",
    "Yao Grass": "Yao Grass, a type of mythical plant. (Chinese mythology)",
    "Benben": "Benben, the mound that arose from the primordial waters Nu, and on which the creator god Atum settled. (Egyptian mythology)",
    "Carnwennan": "Carnwennan (Little White-Hilt), the dagger of King Arthur. It is sometimes attributed with the magical power to shroud its user in shadow, it was used by Arthur to slice the Very Black Witch in half. (Arthurian legend)",
    "Māui's Fishhook": "Māui's Fishhook, used to catch the fish that would become New Zealand's North Island; the hook was also used to create the Hawaiian Islands. (Polynesian mythology)",
    "Tyet": "Tyet, the ancient Egyptian symbol of the goddess Isis. It seems to be called \"the Knot of Isis\" because it resembles a knot used to secure the garments that the Egyptian gods wore (also tet, buckle of Isis, girdle of Isis, and the blood of Isis). (Egyptian mythology)",
    "Armour of Beowulf": "Armour of Beowulf, a mail shirt made by Wayland the Smith. (Norse mythology)",
    "Devil's pitchfork": "Devil's pitchfork, depicted as a bident or two-pronged pitchfork belonging to the devil. (Christian mythology)",
    "Magic wand": "Magic wand, found in the hands of powerful fairies. (Medieval legend)",
    "Huliðshjálmr": "Huliðshjálmr, a concealing helmet of the dwarves. (Norse mythology)",
    "Svíagris": "Svíagris, Adils' prized ring in the Hrólfr Kraki's saga. (Norse mythology)",
    "Rheingold": "Rheingold (also Rhinegold), a hoard of gold in the Nibelungenlied where three Rheinmaidens swim and protect the treasure. (Norse mythology)",
    "Cauldron of Hymir": "Cauldron of Hymir, the owner of a mile-wide cauldron which the Æsir wanted to brew beer in. (Norse mythology)",
    "Petasos": "Petasos (also Petasus), the winged hat of the messenger god Hermes. The Roman equivalent is Mercury. (Greek mythology)",
    "Valknut": "Valknut (also Hrungnir's Heart), Hrungnir's head, heart, and shield were made of stone. His heart had a peculiar shape, it was triangular due to which both the Valknut and the Triquetra have been called Hrungnir's heart. (Norse mythology)",
    "Mantle of Tegau Gold-Breast": "Mantle of Tegau Gold-Breast, Tegau Gold-Breast (Tegau Eurfron, wife of Caradoc) was a Welsh Heroine. Her mantle would not serve for any woman who had violated her marriage or her virginity. It would reach to the ground when worn by a faithful woman but would only hang down to the lap of an unfaithful wife. (Welsh mythology)",
    "Ark of the Covenant": "Ark of the Covenant (also Ark of the Testimony), was a wooden chest clad with gold containing the two stone tablets of the Ten Commandments as well as, according to various texts within the Hebrew Bible, Aaron's rod and a pot of manna. (Christian mythology)",
    "Voodoo doll": "Voodoo doll, an effigy into which pins are inserted. Although it comes in various different forms, such practices are found in the magical traditions of many cultures across the world. (English folklore)",
    "Golden Throne": "Golden Throne, Hephaestus gained revenge against Hera for rejecting him by making her a magical golden throne which when she sat on it, did not allow her to stand up. (Greek mythology)",
    "Helskór": "Helskór (Hel-shoes), were put on the dead so that they could go to Valhöll. (Norse mythology)",
    "Lia Fáil": "Lia Fáil (also Stone of Destiny), a stone at the Inauguration Mound on the Hill of Tara in County Meath, Ireland. In legend, all of the kings of Ireland were crowned on the stone up to Muirchertach mac Ercae c. AD 500. (Irish mythology)",
    "Girdle of Hippolyta": "Girdle of Hippolyta, sometimes called a magical girdle and sometimes a magical belt. It was a symbol of Hippolyta's power over the Amazons; given to her by Ares. Heracles' 9th Labor was to retrieve it. (Greek mythology)",
    "Gada": "Gada, the main weapon of the Hindu god Hanuman, an avatara of Shiva. (Hindu Mythology)",
    "Mead of poetry": "Mead of poetry (also Mead of Suttungr), is a mythical beverage that whoever \"drinks becomes a skald or scholar to recite any information and solve any question. (Norse mythology)",
    "Torii": "Torii, the world was plunged into darkness and chaos. The wrath of Amaterasu, the Goddess of the Sun, led her to retreat to a cave in Amano-Iwato). To make her come out again, the Gods thought over several solutions and decided to set a perch with roosters at the entrance of the cave. They would then sing eternally. Intrigued by their songs, the Amaterasu walked out of the cave, and the world was again bathed in light. Later, people decided to build bird perches at the entrances of shrines. (Japanese mythology)",
    "Emerald Tablet": "Emerald Tablet (also Smaragdine Table or Tabula Smaragdina), is a compact and cryptic piece of the Hermetica reputed to contain the secret of the prima materia and its transmutation. It was highly regarded by European alchemists as the foundation of their art and its Hermetic tradition. The text of the Smaragdine Tablet gives its author as Hermes Trismegistus, a legendary Hellenistic combination of the Greek god Hermes and the Egyptian god Thoth. (Medieval legend)",
    "Vaidurya": "Vaidurya, most precious of all stones, sparkling beauty beyond compare, the stone worn by the goddess Lakshmi and the goddess of wealth Rigveda. (Hindu Mythology)",
    "Narayanastra": "Narayanastra, the personal missile of Vishnu in his Narayana or Naraina form. (Hindu mythology)",
    "Raskovnik": "Raskovnik, a magical herb that has the magical property to unlock or uncover anything that is locked or closed. (Slavic mythology)",
    "Cohuleen druith": "Cohuleen druith, Merrows wear a special hat called a cohuleen druith, which enables them to dive beneath the waves. If they lose this cap, it is said that they will lose their power to return beneath the water. (Scottish folklore)",
    "Red string of fate": "Red string of fate, an East Asian belief originating from Chinese legend. According to this myth, the gods tie an invisible red cord around the ankles of those that are destined to meet one another in a certain situation or help each other in a certain way. Often, in Japanese culture, it is thought to be tied around the little finger. According to Chinese legend, the deity in charge of \"the red thread\" is believed to be Yuè Xià Lǎorén (月下老人), often abbreviated to Yuè Lǎo (月老), the old lunar matchmaker god, who is in charge of marriages. (Chinese mythology)",
    "Ankh": "Ankh, appears frequently in Egyptian tomb paintings and other art, often at the fingertips of a god or goddess. (Egyptian mythology)",
    "Firebird's plumage": "Firebird's plumage, the feathers of a Firebird that glows brightly emitting red, orange, and yellow light, like a bonfire that is just past the turbulent flame. The feathers do not cease glowing if removed, and one feather can light a large room if not concealed. (Slavic mythology)",
    "Hope Diamond": "Hope Diamond, the diamond has been surrounded by a mythology of a reputed curse to the effect that it brings misfortune and tragedy to persons who own it or wear it, but there are strong indications that such stories were fabricated to enhance the stone's mystery and appeal, since increased publicity usually raised the gem's value and newsworthiness. The original form of the Hope Diamond was stolen from an eye of a sculpted statue of the goddess Sita, the wife of Rama, the seventh Avatar of Vishnu.",
    "Gambanteinn": "Gambanteinn, appears in two poems in the Poetic Edda. (Norse mythology)",
    "Agneyastra": "Agneyastra, the god of fire Agni possess a weapon that would discharge and emit flames inextinguishable through normal means. (Hindu mythology)",
    "Wolfssegen": "Wolfssegen (also Wolfsegen and Wolf-Segen), an apotropaic charm against wolves. (European folklore)",
    "Holy Grail": "Holy Grail, a dish, plate, stone, or cup that is part of an important theme of Arthurian literature. (Arthurian legend/Christian mythology)",
    "Aaron's rod": "Aaron's rod, was endowed with miraculous power during the Plagues of Egypt that preceded the Exodus. Was carried by Aaron. (Christian mythology)",
    "Flying Throne of Kai Kavus": "Flying Throne of Kai Kavus, an eagle-propelled craft built by the Persian king Kay Kāvus. It was used for flying the king all the way to China. (Persian mythology)",
    "Golden Bough": "Golden Bough, before entering Hades, Deiphobe tells Aeneas he must obtain the bough of gold which grows nearby in the woods around her cave, and must be given as a gift to Proserpina, the queen of Pluto, king of the underworld. (Roman mythology)",
    "Aphrodite's Magic Girdle": "Aphrodite's Magic Girdle, a magic material that made whoever the wearer desired fall in love with him/her. (Greek mythology)",
    "Snakestones": "Snakestones (also Serpentstones), fossilized ammonites were thought to be petrified coiled snakes, and were called snakestones. They were considered to be evidence for the actions of saints, such as Hilda of Whitby, a myth referenced in Sir Walter Scott's Marmion, and Saint Patrick, and were held to have healing or oracular powers. (Medieval legend)",
    "Hagoromo": "Hagoromo (Feather Dress), a colored or feathered kimono of a tennin. Tennin are unable to fly without these kimonos and thus cannot return to Heaven. (Japanese mythology)",
    "Toadstone": "Toadstone (also Bufonite), a mythical stone or gem thought to be found in, or produced by, a toad, and is supposed to be an antidote to poison. (Medieval legend)",
    "Mikuratana-no-kami": "Mikuratana-no-kami, a necklace of beads. Izanagi gave Amaterasu as a representation of her rule over Takama-ga-hara. (Japanese mythology)",
    "Selkie's skin": "Selkie's skin, said to live as seals in the sea but shed their skin to become human on land. If a man steals a female selkie's skin she is in his power and is forced to become his wife. If she finds her skin she will immediately return to her true home, and sometimes to her selkie husband, in the sea. (European folklore)",
    "Halayudha": "Halayudha, a plough used as a weapon by Balarama. (Hindu mythology)",
    "Yasakani no Magatama": "Yasakani no Magatama, a bejeweled necklace of magatamas offered to Amaterasu. One of three Sacred Imperial Relics of Japan. It represents benevolence. (Japanese mythology)",
    "Yata no Kagami": "Yata no Kagami, a mirror offered to the goddess of the sun, Amaterasu. One of three Sacred Imperial Relics of Japan. It represents Wisdom. (Japanese mythology)",
    "Lantern of Diogenes": "Lantern of Diogenes, according to popular legend, carried in broad daylight by the Cynic philosopher Diogenes of Sinope to aid in his fruitless search for an honest man.",
    "Tablet of Destinies": "Tablet of Destinies (also Tupsimati), a set of clay tablets which hold the power of creation and destruction. (Mesopotamian mythology)",
    "Aglaophotis": "Aglaophotis, an herb. According to Dioscorides, peony is used for warding off demons, witchcraft, and fever.",
    "Necklace of Harmonia": "Necklace of Harmonia, allowed any woman wearing it to remain eternally young and beautiful, but also brought great misfortune to all of its wearers or owners. It was made by Hephaestus and given to Harmonia, the daughter of Aphrodite and Ares, as a curse on the House of Thebes for Aphrodite's infidelity. (Greek mythology)",
    "Cornucopia": "Cornucopia (also Horn of Plenty), was the horn of the goat-nymph Amalthea from which poured an unceasing abundance of nectar, ambrosia and fruit. (Greek mythology)",
    "Osiris's coffin": "Osiris's coffin, a beautifully carved coffin made by Set. Osiris was tricked by Set to enter the chest, and was enclosed inside it by 72 accomplices of Set. Set flung the coffer in the Nile so that it would drift far away. (Egyptian mythology)",
    "Odin's eye": "Odin's eye, Odin sacrifice his eye to Mímir for the price of wisdom, a drink from the Mímisbrunnr. (Norse mythology)",
    "Apollo's lyre": "Apollo's lyre, Hermes created the lyre for him from the entrails of one of Apollo's cow. Apollo was furious at Hermes, but after hearing the sound of the lyre, his anger faded. The instrument became a common attribute of Apollo. (Greek mythology)",
    "Manna machine": "Manna machine, a machine describe within the Zohar writings that is similar to chlorella algae processing of today. (Jewish mythology)",
    "Pridwen": "Pridwen (also Wynebgwrthucher), the shield of King Arthur. (Arthurian legend)",
    "Batrachite": "Batrachite, gemstones that was supposedly found in frogs, to which ancient physicians and naturalists attributed the virtue of resisting poison. (Medieval legend)",
    "Rati": "Rati, the name of a drill or auger that was used by Odin during his quest to obtain the mead of poetry. (Norse mythology)",
    "Adder stone": "Adder stone, believed to have magical powers such as protection against eye diseases or evil charms, preventing nightmares, curing whooping cough, the ability to see through fairy or witch disguises and traps if looked at through the middle of the stone, and of course recovery from snakebite. (Welsh mythology)",
    "Vasavi Shakti": "Vasavi Shakti, the magical dart of Indra. Used by Karna against Ghatotkacha in the Mahabharata war. (Hindu mythology)",
    "Llech Ronw": "Llech Ronw (also Slate of Gron), a holed stone located along Afon Bryn Saeth in Blaenau Ffestiniog, Wales. The stone is described as being roughly forty inches by thirty inches with a hole of about an inch in diameter going through it. (Welsh mythology)",
    "Hand of Glory": "Hand of Glory, a disembodied pickled hand of a man who was hanged alive. Said to have the power to unlock any door and, if a candle was placed within made from some body part of the same person, would freeze in place anyone who it was given to. (European folklore)",
    "Pan's flute": "Pan's flute, reed pipes or pan flute that is played by the god of the wild, Pan who somewhat resembles a satyr or faun. (Greek mythology)",
    "Guingelot": "Guingelot, Thomas Speght, an editor or Chaucer's works from the end of 16th century, made a passing remark that \"Concerning Wade and his bote called Guingelot, and also his strange exploits in the same.",
    "Silphium": "Silphium, a plant that was used in classical antiquity as a seasoning and as a medicine. Legend said that this plant was a gift from the god Apollo. (Roman mythology)",
    "Talos": "Talos, a giant automaton made of bronze to protect Europa in Crete from pirates and invaders. He circled the island's shores three times daily. (Greek mythology)",
    "Knife of Llawfrodedd the Horseman": "Knife of Llawfrodedd the Horseman, Llawfrodedd Farchog (from marchog \"the Horseman\"), or Barfawc \"the Bearded\" in other manuscripts, is said to have owned a knife which would serve for a company of 24 men at the dinner table. (Welsh mythology)",
    "Seal of Solomon": "Seal of Solomon, a magical brass or steel ring that could imprison demons. (Jewish mythology/Christian mythology)",
    "Wishing well": "Wishing well, wells where it was thought that any spoken wish would be granted. The idea that a wish would be granted came from the idea that water housed deities or had been placed there as a gift from the gods, since water was a source of life and often a scarce commodity. (European folklore)",
    "Haoma": "Haoma, the Avestan language name of a plant and its divinity, both of which play a role in Zoroastrian doctrine and in later Persian culture and mythology.",
    "Hvergelmir": "Hvergelmir (Bubbling Boiling Spring), a major spring. (Norse mythology)",
    "Dubán": "Dubán, the black shield of Cú Chulainn. (Irish mythology)",
    "Seer stone": "Seer stone, some early-nineteenth-century Americans used seer stones in attempts to gain revelations from God or to find buried treasure. From about 1819, Joseph Smith regularly practiced scrying, a form of divination in which a \"seer\" looked into a seer stone to receive supernatural knowledge.",
    "Triton's conch shell": "Triton's conch shell, a twisted conch shell on which Triton blew like a trumpet to calm or raise the waves. (Greek mythology)",
    "Libra": "Libra (Weighing Scales), considered to depict the scales held by Astraea (identified as Virgo), the goddess of justice. (Roman mythology)",
    "Angelica's ring": "Angelica's ring, a ring possessed by Angelica, princess of Cathay in the legends of Charlemagne. It rendered its wearer immune to all enchantments. When placed in the mouth, the ring rendered the user invisible. (Mythology in France)",
    "Pasha": "Pasha, a supernatural weapon depicted in Hindu iconography. Hindu deities such as Ganesha, Yama and Varuna are depicted with the pasha in their hands. The pasha is used to bind a foe's arms and legs or for hunting animals. (Hindu mythology)",
    "Roth Rámach": "Roth Rámach (lit. Rowing Wheel), the magical flying machine of Mug Ruith, a mythological Irish Druid who along with his feathered headdress (the encennach), hovers across the skies [2]. (Irish Mythology)",
    "Rod of Asclepius": "Rod of Asclepius, a serpent-entwined rod wielded by the Greek god Asclepius, a deity associated with healing and medicine. (Greek mythology)",
    "Horn of Brân Galed": "Horn of Brân Galed, the Horn of Brân Galed from the North is said to have possessed the magical property of ensuring that \"whatever drink might be wished for was found in it\". (Welsh mythology)",
    "Brísingamen": "Brísingamen, the necklace of the goddess Freyja. (Norse mythology)",
    "Bashōsen": "Bashōsen (Banana Palm Fan), a giant fan weapon used by Ginkaku. (Chinese mythology",
    "Kenkonken": "Kenkonken, a chakram of great power wielded in Taoist mythology by Nezha. Nezha is a mythological figure who is often depict as a young handsome boy wearing clothes similar to a lotus since he was reincarnated from a lotus. He has two wheels with flames attached to his feet and golden ankle rings. (Chinese mythology)",
    "Shield of Achilles": "Shield of Achilles, the shield that Achilles uses in his fight with Hector. (Greek mythology)",
    "Draconite": "Draconite, a mythical gemstone taken from the head of a live dragon and believed to have magical properties.",
    "Draupnir": "Draupnir, a golden arm ring possessed by Odin. The ring was a source of endless wealth. (Norse mythology)",
    "Coat of Padarn Beisrudd": "Coat of Padarn Beisrudd, a coat that perfectly fits any brave man, but will not fit cowards. (Welsh mythology)",
    "Svalinn": "Svalinn, a shield which stands before the sun and protects earth from burning. If the shield were to fall from its frontal position, mountain and sea \"would burn up\". (Norse mythology)",
    "Athena's bridle": "Athena's bridle, Polyeidos told Bellerophon to sleep in the temple of Athena. While he slept, he dreamed that Athena set a golden bridle beside him. He awoke and found the bridle he dreamt about in his hands. Afterwards, he went to the meadow Pegasus was grazing at, and was able to bridle and tame Pegasus without difficulty. (Greek mythology)",
    "Bragi's harp": "Bragi's harp, a magical golden harp given to Bragi by the dwarfs when he was born. (Norse mythology)",
    "Olifant": "Olifant (also Olivant), the horn of Roland, paladin of Charlemagne in the Song of Roland. Roland blows the horn, but the force required bursts his temple, resulting in death. His olifant was supposedly a unicorn's horn. (Matter of France)",
    "Magic Lamp": "Magic Lamp, an oil lamp that can be rubbed in order to summon a genie who grants wishes. (Arabic mythology)",
    "Holy well": "Holy well (also Sacred Spring), a spring revered either in a Pagan or Christian context, often both. Holy wells were frequently pagan sacred sites that later became Christianized. The term holy well is commonly employed to refer to any water source of limited size (i.e. not a lake or river, but including pools and natural springs and seeps), which has some significance in the folklore of the area where it is located, whether in the form of a particular name, an associated legend, the attribution of healing qualities to the water through the numinous presence of its guardian spirit or Christian saint.",
    "Ankusha": "Ankusha (also Elephant Goad), an elephant goad is one of the eight auspicious objects known as Astamangala and certain other religions of the Indian subcontinent. Ankusha is also an attribute of many Hindu gods, including Ganesha. (Hindu mythology)",
    "Crown of Immortality": "Crown of Immortality, represented in art first as a laurel wreath and later as a symbolic circle of stars. The Crown appears in a number of Baroque iconographic and allegoric works of art to indicate the wearer's immortality.",
    "Kantele": "Kantele, the mage Väinämöinen makes the first kantele from the jawbone of a giant pike and a few hairs from Hiisi's stallion. The music it makes draws all the forest creatures near to wonder at its beauty. (Finnish mythology)",
    "Robe of the Fire-rat": "Robe of the Fire-rat, a legendary robe of China that is made of the fireproof fur of the fire-rat. One of Kaguya-hime's suitor set out to search for the robe. (Japanese mythology)",
    "Andvaranaut": "Andvaranaut, a magical ring capable of producing gold, first owned by Andvari. (Norse mythology)",
    "Flying mortar and pestle of Baba Yaga": "Flying mortar and pestle of Baba Yaga, she flies around in a mortar and wields a pestle. (Slavic Mythology)",
    "Trojan Horse": "Trojan Horse, a huge wooden horse where a select force of men hide inside during the Trojan War, the subterfuge that the Greeks used to enter the city of Troy and win the war. (Greek mythology)",
    "Stone of Scone": "Stone of Scone (also Stone of Destiny), an oblong block of red sandstone. (Matter of Britain)",
    "Prometheus's chains": "Prometheus's chains, chained to a rock with shackles of binding adamantine that cannot be broken, they were made by Hephaestus. (Greek mythology)",
    "Sling-stone": "Sling-stone (also Cloich Tabaill), was used by Lugh to slay his grandfather, Balor the Strong-Smiter in the Cath Maige Tuired according to the brief accounts in the Lebor Gabála Érenn. (Irish mythology)",
    "Óðrerir": "Óðrerir, refers either to one of the vessels that contain the mead of poetry (along with Boðn and Són) or to the mead itself. (Norse mythology)",
    "Helm of Awe": "Helm of Awe (also Helm of Terror or Ægishjálmr), an Icelandic magical stave. A physical object called \"Helm of Terror\" is referenced as one item Sigurd takes from the dragon Fafnir's hoard after he slays him in Völsunga saga. (Norse mythology)",
    "Odin's whetstone": "Odin's whetstone, Baugi had nine thralls who killed each other in their desire to possess Odin's magical sharpening stone. (Norse mythology)",
    "Ningyo's flesh": "Ningyo's flesh, the flesh is pleasant-tasting, and anyone who eats it will attain remarkable longevity. (Japanese mythology)",
    "Gates of Alexander": "Gates of Alexander, a legendary barrier supposedly built by Alexander the Great in the Caucasus to keep the uncivilized barbarians of the north (typically associated with Gog and Magog) from invading the land to the south. Alexander the Great built the walls made of adamantine. (Medieval legend)",
    "A phantom funeral train": "A phantom funeral train, a funeral train decorated in black bunting said to run regularly from Washington, D.C. to Springfield, Illinois, around the time of the anniversary of Abraham Lincoln's death, stopping watches and clocks in surrounding areas as it passes. (American folklore)",
    "Jiuchidingpa": "Jiuchidingpa (Nine-tooth Iron Rake), the primary weapon of Zhu Bajie. (Chinese mythology)",
    "Shoes of Víðarr": "Shoes of Víðarr, these shoes gave the god Vidar unparalleled foot protection. (Norse mythology)",
    "Panchajanya": "Panchajanya, a Shankha conch shell of the Hindu god Vishnu. As per Valmiki Ramyana, Purushottama (Vishnu) killed a Danava named Panchajana on a mountain named Chakravan constructed by Vishwakarma and took away conch shell known as Panchajanya from him. (Hindu mythology)",
    "Crater": "Crater (Cup), identified with the cup of the god Apollo. (Greek mythology)",
    "Sampo": "Sampo (also Sammas), a magical artifact of indeterminate type constructed by Ilmarinen that brought good fortune to its holder. (Finnish mythology)",
    "Halter of Clydno Eiddyn": "Halter of Clydno Eiddyn, belonged to Clydno Eiddyn (Cebystr Clydno Eiddin). It was fixed to a staple at the foot of his bed. Whatever horse he might wish for, he would find in the halter. The Halter of Clydno Eiddyn was also called The Handy Halter, for it summons fine horses. (Welsh mythology)",
    "Green Dragon Crescent Blade": "Green Dragon Crescent Blade, a legendary weapon wielded by Guan Yu in the historical novel Romance of the Three Kingdoms. It is a guandao, a type of traditional Chinese weapon. It is also sometimes referred to as the Frost Fair Blade, from the idea that during a battle in the snow, the blade continuously had blood on it; the blood froze and made a layer of frost on the blade. (Chinese mythology)",
    "Forbidden fruit": "Forbidden fruit, the fruit of good and evil was eaten by Adam and Eve in the Garden of Eden, which they had been commanded not to do by God. (Christian mythology)",
    "Reginnaglar": "Reginnaglar (Old Norse God Nails), are nails used for religious purposes. (Norse mythology)",
    "Sanjeevani": "Sanjeevani, a magical herb which has the power to cure any malady. It was believed that medicines prepared from this herb could revive a dead person. (Hindu mythology)",
    "Ushabti": "Ushabti, a funerary figurine used in Ancient Egypt. Ushabtis were placed in tombs among the grave goods and were intended to act as servants or minions for the deceased, should he/she be called upon to do manual labor in the afterlife. (Egyptian mythology)",
    "Bag of Wind": "Bag of Wind, Aeolus gave Odysseus a tightly closed leather bag full of the captured winds so he could sail easily home to Ithaca on the gentle West Wind. (Greek mythology)"
}